w = ('=')*50
#Основные типы данных

#int - integer - целое число(42)
#float - дробное число(42.5)
#str - строка('text')
#bool - булевый тип (True - истина, False - ложь)
#None - пустой тип данных
 
print(w) 
print(42)
print(42.5)
print('text')
print(True)
a = 45
print(a + 2)
b = None
print(b)

print(w)
#Операторы
#or #или
#and #и
#not #не
#in #входит в
#not in #не входит в
#is #является
#is not #не является

#> #больше
#< #меньше
#>= #больше или равно
#<= #меньше или равно
#== #равно
#!= #не равно
#+= #прибавить и присвоить
#-= #вычесть и присвоить
#*= #умножить и присвоить
# /= #разделить и присвоить
# %= #остаток от деления и присвоить
# **= #возвести в степень и присвоить
# 9//4 = 2 #целочисленное деление(округление в меньшую сторону)

c = 'text'
d = 'text'
print(c is d)
print(c == d)





